{
    "marketCap": 96192102400,
    "trailingPE": 36.847828,
    "forwardPE": 32.224335,
    "dividendYield": 2.38,
    "sector": "Consumer Cyclical",
    "longBusinessSummary": "Wesfarmers Limited engages in the retail business in Australia, New Zealand, and internationally. It sells outdoor living and building materials, as well as home, garden, and lifestyle improvement products; apparel and general merchandise, including toys and consumables, as well as leisure, entertainment, and soft home products; and office products and solutions, such as stationery, technology, furniture, art supplies, and learning and development resources, as well as print and create, and technical support services through its Officeworks stores. It also provides hardware and software repairs, system security solutions, wireless and wired networking services, virus and spyware prevention and removal, and data backup and recovery solutions. In addition, it manufactures and supplies ammonia, ammonium nitrate, and industrial chemicals; manufactures, imports, and distributes phosphate, nitrogen, and potassium-based fertilizers, as well as LPG; supplies polyvinyl chloride resins; produces wood-plastic composite products; and manufactures and distributes sodium cyanide and lithium hydroxide. Further, It produces and distributes liquefied petroleum gas and liquefied natural gas; supplies and distributes maintenance, repair, operating products, and industrial safety products and services; manufactures and markets industrial, medical, and specialty gases and equipment; supplies tools, safety gear, personal protective equipment, electricals, work wear, and industrial supplies; and provides risk and compliance management services, as well as footwear; safety products, uniforms, engineering supplies, and packaging services; and engages in other businesses. Additionally, it provides health, beauty, and wellbeing products and services; clinical cosmetic and skin care treatments; retail support services; distributes pharmaceutical goods; and operates online marketplace and data sharing platform. The company was founded in 1914 and is headquartered in Perth, Australia.",
    "exchange": "ASX",
    "currency": "AUD",
    "shortName": "WESFARMER FPO [WES]",
    "symbol": "WES.AX",
    "fetchedTimestamp": "2025-06-30T12:05:44.001883"
}